[
    {
        "id": "Jurassic Park",
        "title": "Jurassic Park",
        "genre": "Action",
        "synopsis": "Jurassic Park adalah film aksi fiksi ilmiah Amerika Serikat tahun 1993 yang disutradarai oleh Steven Spielberg dan ditulis oleh Michael Crichton dan David Koepp, berdasarkan novel tahun 1990 karya Crichton berjudul sama. Film ini dibintangi oleh Sam Neill, Laura Dern, Jeff Goldblum, dan Richard Attenborough, dan berlatar di pulau fiksi Isla Nublar dekat Costa Rica, di mana pengusaha kaya John Hammond dan tim ilmuwan genetika telah menciptakan taman satwa liar yang dihuni oleh dinosaurus yang telah dibangkitkan dari kepunahan. Ketika sabotase industri menyebabkan pemadaman listrik dan sistem keamanan taman, sekelompok kecil pengunjung berjuang untuk bertahan hidup dan melarikan diri dari pulau yang kini menjadi berbahaya.",
        "video": "movies/Jurassic Park.mp4",
        "poster": "movies/Jurassic Park_poster.jpg",
        "subtitle": "movies/Jurassic Park.vtt"
    },
    {
        "id": "Harry Potter and the Sorcerers Stone",
        "title": "Harry Potter and the Sorcerer's Stone",
        "genre": "Sci-Fi",
        "synopsis": "Harry Potter adalah seorang anak laki laki yang tampaknya biasa, hidup dengan keluarga yang berhubungan darah dengan-nya, keluarga Dursley di Surrey. Pada ulang tahunnya yang kesebelas, Harry mengetahui dari seorang asing misterius, Rubeus Hagrid, bahwa ia sebenarnya seorang penyihir, terkenal di Dunia sihir karena dapat bertahan dari serangan Lord Voldemort yang jahat ketika Harry masih bayi. Voldemort membunuh orang tua Harry, tetapi serangan kepada Harry gagal dilakukan, kejadian tersebut menyisakan bekas luka berbentuk petir di dahi Harry dan membuat Voldemort tewas. Hagrid mengungkapkan kepada Harry bahwa ia telah diundang untuk bersekolah di Hogwarts, sebuah Sekolah Sihir. Setelah membeli perlengkapan sekolahnya di Diagon Alley, Harry berangkat dengan menggunakan kereta ke Hogwarts melalui Platform 9 ¾ yang tersembunyi di Stasiun King's Cross di London.",
        "video": "movies/Harry Potter and the Sorcerers Stone.mp4",
        "poster": "movies/Harry Potter and the Sorcerers Stone_poster.jpg",
        "subtitle": "movies/Harry Potter and the Sorcerers Stone.vtt"
    },
    {
        "id": "1766832299_The Lost World Jurassic Park",
        "title": "The Lost World: Jurassic Park",
        "genre": "Action",
        "synopsis": "4 tahun setelah film aslinya, John Hammond ( Attenborough ) kehilangan kendali atas perusahaannya InGen kepada keponakannya, Peter Ludlow ( Howard ). Di ambang kebangkrutan, Ludlow bermaksud mengeksploitasi dinosaurus dari pulau kedua InGen, Isla Sorna, dengan rencana pembangunan taman hiburan dinosaurus baru di San Diego. Hammond mengirimkan tim, dipimpin oleh ahli teori chaos dan matematikawan eksentrik Ian Malcolm ( Goldblum ), ke pulau itu untuk mendokumentasikan dinosaurus dan mendorong non-intervensi, meskipun kedua kelompok tersebut akhirnya berkonflik.",
        "video": "movies/1766832299_The Lost World Jurassic Park.mp4",
        "poster": "movies/1766832299_The Lost World Jurassic Park_poster.jpg",
        "subtitle": "movies/1766832299_The Lost World Jurassic Park.vtt"
    },
    {
        "id": "1766833209_Jurassic Park III",
        "title": "Jurassic Park III",
        "genre": "Action",
        "synopsis": "Jurassic Park III adalah film fiksi ilmiah menegangkan Amerika Serikat tahun 2001 yang disutradarai oleh Joe Johnston dan ditulis oleh Peter Buchman, Alexander Payne, dan Jim Taylor.[5] Film ini merupakan film ketiga dalam waralaba Jurassic Park dan film terakhir dalam trilogi Jurassic Park orisinal, setelah The Lost World: Jurassic Park (1997). Film ini juga merupakan film pertama dalam franchise yang tidak disutradarai oleh Steven Spielberg, serta film pertama yang tidak diadaptasi dari novel karya Michael Crichton; tetapi, film ini menampilkan karakter dan ide-ide dari Crichton. Film ini dibintangi oleh Sam Neill, William H. Macy, Téa Leoni, Alessandro Nivola, Trevor Morgan, dan Michael Jeter, dengan penampilan singkat dari Laura Dern. Neill dan Dern kembali memerankan karakter mereka dari film pertama sebagai Alan Grant dan Ellie Sattler. Alur cerita melibatkan sepasang suami istri yang bercerai yang, melalui tipu daya, meminta bantuan paleontolog Dr. Grant untuk mencari anak mereka yang hilang di Isla Sorna.",
        "video": "movies/1766833209_Jurassic Park III.mp4",
        "poster": "movies/1766833209_Jurassic Park III_poster.jpg",
        "subtitle": "movies/1766833209_Jurassic Park III.vtt"
    },
    {
        "id": "1766834043_Jurassic World",
        "title": "Jurassic World",
        "genre": "Action",
        "synopsis": "Dua puluh dua tahun setelah insiden Isla Nublar (di film Jurassic Park), Zach Mitchell (Nick Robinson) dan Gray Mitchell (Ty Simpkins) berwisata sekaligus mengunjungi bibi mereka, Claire Dearing (Bryce Dallas Howard). Claire merupakan manajer operasional taman Jurassic World, sebuah taman dinosaurus berfungsi penuh yang berlokasi di Isla Nublar, sebuah pulau lepas pantai Kosta Rika. Sampai di pulau itu, mereka mengetahui bahwa Claire terlalu sibuk untuk menghabiskan waktu dengan mereka sehingga mereka harus dijaga oleh asisten pribadinya, Zara (Katie McGrath). Simon Masrani (Irrfan Khan), pemilik taman sekaligus kepala Masrani Corporation (yang membeli InGen, perusahaan yang mengelola Jurassic Park pada film-film sebelumnya), datang dan memanggil Claire untuk melihat dinosaurus baru hasil rekayasa genetika mereka, Indominus rex. Setelah pemeriksaan kandang, Simon mengatakan ia ingin memanggil Owen Grady (Chris Pratt), seorang mantan prajurit angkatan laut, ahli dan pelatih empat Velociraptor, untuk memastikan kandang Indominus rex kukuh dan memadai.",
        "video": "movies/1766834043_Jurassic World.mp4",
        "poster": "movies/1766834043_Jurassic World_poster.jpg",
        "subtitle": "movies/1766834043_Jurassic World.vtt"
    },
    {
        "id": "1766834905_Jurassic World Fallen Kingdom",
        "title": "Jurassic World: Fallen Kingdom",
        "genre": "Action",
        "synopsis": "Jurassic World: Fallen Kingdom menampilkan adegan awalnya pada suatu malam di Isla Nublar. Tiga tahun setelah taman dinosaurus di pulau itu mengalami kekacauan, sebuah helikopter membawa tim dengan misi mengambil tulang-belulang indominus rex yang tersisa di pantai. Sayangnya, kemunculan mosasaurus dan t-rex menggagalkan misi tersebut dan memicu terbukanya pagar batas yang berada di bawah laut.\n\nDi tempat lain, pemerintahan dunia tengah mengadakan pertemuan. Mereka membahas tentang gunung api di Isla Nublar yang akan meletus. Pertemuan itu menghasilkan keputusan bahwa pemerintah tidak akan melakukan tindakan apa pun selama tidak ada kehidupan manusia yang terancam akibat letusan tersebut.",
        "video": "movies/1766834905_Jurassic World Fallen Kingdom.mp4",
        "poster": "movies/1766834905_Jurassic World Fallen Kingdom_poster.png",
        "subtitle": "movies/1766834905_Jurassic World Fallen Kingdom.vtt"
    },
    {
        "id": "1766835649_Jurassic World Dominion",
        "title": "Jurassic World Dominion",
        "genre": "Action",
        "synopsis": "Empat tahun setelah kehancuran vulkanik Isla Nublar dan insiden Lockwood Estate[a], dinosaurus yang sudah punah sekarang bebas berkeliaran di antara manusia. Claire Dearing, mantan manajer operasi Jurassic World, bekerja untuk melindungi dinosaurus dari organisasi pengembangbiakan ilegal. Dia dan Owen Grady telah tinggal di kabin pegunungan terpencil untuk melindungi Maisie Lockwood, cucu kloningan Sir Benjamin Lockwood. Mereka terkejut ketika Velociraptor Blue terlatih Owen tiba-tiba tiba di kabin dengan seorang keturunan. Maisie menjuluki bayi raptor, \"Beta\".",
        "video": "movies/1766835649_Jurassic World Dominion.mp4",
        "poster": "movies/1766835649_Jurassic World Dominion_poster.jpeg",
        "subtitle": "movies/1766835649_Jurassic World Dominion.vtt"
    },
    {
        "id": "1766836974_Jurassic World Rebirth",
        "title": "Jurassic World Rebirth",
        "genre": "Action",
        "synopsis": "Pada tahun 2008, InGen mengoperasikan laboratorium penelitian dinosaurus di Île Saint-Hubert, sebuah pulau yang terletak 226 mil di sebelah timur Guyana Prancis di Samudra Atlantik. Laboratorium tersebut melakukan eksperimen genetika, termasuk menciptakan dinosaurus transgenik dan mutasinya. Salah satu ciptaan mereka, seekor Tyrannosaur berwujud aneh dengan enam kaki yang diberi nama Distortus rex membunuh seorang karyawan dan menimbulkan kekacauan, memaksa personel untuk meninggalkan pulau.\n\nPada tahun 2025, iklim sebagian besar daerah di Bumi sudah tidak layak huni bagi dinosaurus.[a] Dinosaurus-dinosaurus yang masih mampu bertahan hidup berada di daerah sekitar ekuator, yang iklimnya relatif masih mirip dengan iklim di masa Mesozoikum.",
        "video": "movies/1766836974_Jurassic World Rebirth.mp4",
        "poster": "movies/1766836974_Jurassic World Rebirth_poster.jpg",
        "subtitle": "movies/1766836974_Jurassic World Rebirth.vtt"
    },
    {
        "id": "1766838127_Harry Potter and the Chamber of Secrets",
        "title": "Harry Potter and the Chamber of Secrets",
        "genre": "Sci-Fi",
        "synopsis": "Harry Potter disuruh mempersiapkan rumah untuk kunjungan dari klien potensial Vernon Dursley. Namun, setelah selesai, paman Dursley menyuruh Harry ke kamarnya. Di kamar, Harry bertemu Dobby si peri rumah, ia memperingatkan Harry untuk tidak kembali ke Hogwarts. Ketika Harry menolak, Dobby menyebabkan kekacauan di rumah dan membuat Harry merusak pertemuan Vernon. Vernon mengunci Harry di kamarnya untuk mencegah kembali ke Hogwarts. Namun, Ron, Fred, dan George Weasley tiba dengan mobil terbang mereka untuk menyelamatkan Harry dari cengkeraman Paman Vernon, yang sedang berusaha untuk menarik Harry kembali ke kamarnya. Harry kemudian dibawa ke The Burrow, rumah keluarga Weasley.",
        "video": "movies/1766838127_Harry Potter and the Chamber of Secrets.mp4",
        "poster": "movies/1766838127_Harry Potter and the Chamber of Secrets_poster.jpg",
        "subtitle": "movies/1766838127_Harry Potter and the Chamber of Secrets.vtt"
    }
]